wikimedia/smash-pig/Tests/SoapInjector/authorization.xml

<?xml version="1.0" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<ns1:sendNotification xmlns:ns1="http://notification.services.adyen.com">
			<ns1:notification>
				<live xmlns="http://notification.services.adyen.com">false</live>
				<notificationItems xmlns="http://notification.services.adyen.com">
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount>
							<currency xmlns="http://common.services.adyen.com">EUR</currency>
							<value xmlns="http://common.services.adyen.com">10100</value>
						</amount>
						<eventCode>AUTHORISATION</eventCode>
						<eventDate>2012-12-14T20:45:35.374+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference>n/a</merchantReference>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod>bankTransfer_DE</paymentMethod>
						<pspReference>testnotification1_AUTHORISATION</pspReference>
						<reason xsi:nil="true"/>
						<success>true</success>
					</NotificationRequestItem>
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount>
							<currency xmlns="http://common.services.adyen.com">GBP</currency>
							<value xmlns="http://common.services.adyen.com">20100</value>
						</amount>
						<eventCode>AUTHORISATION</eventCode>
						<eventDate>2012-12-14T20:45:35.374+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference>n/a</merchantReference>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod>maestro</paymentMethod>
						<pspReference>testnotification2_AUTHORISATION</pspReference>
						<reason xsi:nil="true"/>
						<success>true</success>
					</NotificationRequestItem>
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount>
							<currency xmlns="http://common.services.adyen.com">EUR</currency>
							<value xmlns="http://common.services.adyen.com">10150</value>
						</amount>
						<eventCode>AUTHORISATION</eventCode>
						<eventDate>2012-12-14T20:45:35.374+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference>n/a</merchantReference>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod>bcmc</paymentMethod>
						<pspReference>testnotification3_AUTHORISATION</pspReference>
						<reason>REFUSED</reason>
						<success>false</success>
					</NotificationRequestItem>
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount>
							<currency xmlns="http://common.services.adyen.com">GBP</currency>
							<value xmlns="http://common.services.adyen.com">20150</value>
						</amount>
						<eventCode>AUTHORISATION</eventCode>
						<eventDate>2012-12-14T20:45:35.374+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference>n/a</merchantReference>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod>bankTransfer_NL</paymentMethod>
						<pspReference>testnotification4_AUTHORISATION</pspReference>
						<reason>REFUSED</reason>
						<success>false</success>
					</NotificationRequestItem>
					<NotificationRequestItem>
						<additionalData>
							<entry>
								<key xsi:type="xsd:string">cvcResult</key>
								<value xsi:type="xsd:string">1 Matches</value>
							</entry>
							<entry>
								<key xsi:type="xsd:string">avsResult</key>
								<value xsi:type="xsd:string">1 Address matches, postal code doesn't</value>
							</entry>
						</additionalData>
						<amount>
							<currency xmlns="http://common.services.adyen.com">USD</currency>
							<value xmlns="http://common.services.adyen.com">1000</value>
						</amount>
						<eventCode>AUTHORISATION</eventCode>
						<eventDate>2016-01-25T17:07:36.862+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference>2490755306</merchantReference>
						<operations>
							<string>CANCEL</string>
							<string>CAPTURE</string>
							<string>REFUND</string>
						</operations>
						<originalReference xsi:nil="true"/>
						<paymentMethod>amex</paymentMethod>
						<pspReference>8614537380566243</pspReference>
						<reason>27533:0003:6/2016</reason>
						<success>true</success>
					</NotificationRequestItem>
				</notificationItems>
			</ns1:notification>
		</ns1:sendNotification>
	</soap:Body>
</soap:Envelope>
